Revit 2027 API
UIApplication.DoDragDrop(Object, IDropHandler) Method
Initiates a drag and drop operation with a custom drop implementation.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void DoDragDrop(
	Object dropData,
	IDropHandler handler
)
Public Shared Sub DoDragDrop (
	dropData As Object,
	handler As IDropHandler
)
public:
static void DoDragDrop(
	Object^ dropData,
	IDropHandler^ handler
)
static member DoDragDrop :
        dropData : Object *
        handler : IDropHandler -> unit
Parameters
dropData Object
Any arbitrary data to be passed to the drop handler when the drop occurs.
handler IDropHandler
The handler to be executed when the drop occurs.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when dropData or handler is null.
Remarks
 When the user inputs IControllableDropHandler, it allows the handler to verify whether the drop event can be executed on the given view; When the user inputs IDropHandler the handler will be executed without any condition.
See Also
Reference
UIApplication Class
DoDragDrop Overload
Autodesk.Revit.UI Namespace